fullyautomated/mspm0-svd/svd/mspm0l110x.svd
                <register>
                    <name>INT_EVENT0_IIDX</name>
                    <description>Interrupt index</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT0_IIDX_STAT</name>
                            <description>I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MRXDONEFG</name>
                                    <description>MRXDONEFG</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MTXDONEFG</name>
                                    <description>MTXDONEFG</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MRXFIFOTRG</name>
                                    <description>MRXFIFOTRG</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MTXFIFOTRG</name>
                                    <description>MTXFIFOTRG</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MRXFIFOFULL</name>
                                    <description>MRXFIFOFULL</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MTX_EMPTY</name>
                                    <description>MTX_EMPTY</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MNACKFG</name>
                                    <description>MNACKFG</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MSTARTFG</name>
                                    <description>MSTARTFG</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MSTOPFG</name>
                                    <description>MSTOPFG</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MARBLOSTFG</name>
                                    <description>MARBLOSTFG</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MDMA_DONE1_CH2</name>
                                    <description>MDMA_DONE1_CH2</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MDMA_DONE1_CH3</name>
                                    <description>MDMA_DONE1_CH3</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MPEC_RX_ERR</name>
                                    <description>MPEC_RX_ERR</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_TIMEOUTA</name>
                                    <description>TIMEOUTA</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_TIMEOUTB</name>
                                    <description>TIMEOUTB</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SRXDONEFG</name>
                                    <description>SRXDONEFG</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_STXDONEFG</name>
                                    <description>STXDONEFG</description>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SRXFIFOTRG</name>
                                    <description>SRXFIFOTRG</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_STXFIFOTRG</name>
                                    <description>STXFIFOTRG</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SRXFIFOFULL</name>
                                    <description>SRXFIFOFULL</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_STXEMPTY</name>
                                    <description>STXEMPTY</description>
                                    <value>22</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SSTARTFG</name>
                                    <description>SSTARTFG</description>
                                    <value>23</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SSTOPFG</name>
                                    <description>SSTOPFG</description>
                                    <value>24</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SGENCALL</name>
                                    <description>SGENCALL</description>
                                    <value>25</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SDMA_DONE1_CH2</name>
                                    <description>SDMA_DONE1_CH2</description>
                                    <value>26</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SDMA_DONE1_CH3</name>
                                    <description>SDMA_DONE1_CH3</description>
                                    <value>27</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SPEC_RX_ERR</name>
                                    <description>SPEC_RX_ERR</description>
                                    <value>28</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_STX_UNFL</name>
                                    <description>STX_UNFL</description>
                                    <value>29</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SRX_OVFL</name>
                                    <description>SRX_OVFL</description>
                                    <value>30</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_SARBLOST</name>
                                    <description>SARBLOST</description>
                                    <value>31</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_INTR_OVFL</name>
                                    <description>INTR_OVFL</description>
                                    <value>32</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
