fullyautomated/mspm0-svd/svd/mspm0l110x.svd
                <register>
                    <name>INT_EVENT0_ICLR</name>
                    <description>Interrupt clear</description>
                    <addressOffset>0x1048</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT0_ICLR_MRXDONE</name>
                            <description>Master Receive Data Interrupt
Signals that a byte has been received</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MRXDONE_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MRXDONE_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_TIMEOUTA</name>
                            <description>Timeout A interrupt</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_TIMEOUTA_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_TIMEOUTA_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MNACK</name>
                            <description>Address/Data NACK Interrupt</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MNACK_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MNACK_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MSTART</name>
                            <description>START Detection Interrupt</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MSTART_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MSTART_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MSTOP</name>
                            <description>STOP Detection Interrupt</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MSTOP_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MSTOP_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MARBLOST</name>
                            <description>Arbitration Lost Interrupt</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MARBLOST_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MARBLOST_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MTXDONE</name>
                            <description>Master Transmit Transaction completed Interrupt</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MTXDONE_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MTXDONE_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MRXFIFOFULL</name>
                            <description>RXFIFO full event.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MRXFIFOFULL_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MRXFIFOFULL_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MTXEMPTY</name>
                            <description>Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MTXEMPTY_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MTXEMPTY_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MRXFIFOTRG</name>
                            <description>Master Receive FIFO Trigger
Trigger when RX FIFO contains &amp;gt;= defined bytes</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MRXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MTXFIFOTRG</name>
                            <description>Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &amp;lt;= defined bytes</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MTXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MTXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MDMA_DONE1_2</name>
                            <description>DMA Done 1 on Event Channel 2</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MDMA_DONE1_2_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MDMA_DONE1_2_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_MDMA_DONE1_3</name>
                            <description>DMA Done 1 on Event Channel 3</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MDMA_DONE1_3_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_MDMA_DONE1_3_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_SRXDONE</name>
                            <description>Slave Receive Data Interrupt
Signals that a byte has been received</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SRXDONE_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SRXDONE_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_STXDONE</name>
                            <description>Slave Transmit Transaction completed Interrupt</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_STXDONE_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_STXDONE_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_SGENCALL</name>
                            <description>General Call Interrupt</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SGENCALL_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SGENCALL_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_STXEMPTY</name>
                            <description>Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_STXEMPTY_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_STXEMPTY_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_SRXFIFOFULL</name>
                            <description>RXFIFO full event. This interrupt is set if an RX FIFO is full.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SRXFIFOFULL_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SRXFIFOFULL_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_SRXFIFOTRG</name>
                            <description>Slave Receive FIFO Trigger</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SRXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_STXFIFOTRG</name>
                            <description>Slave Transmit FIFO Trigger</description>
                            <bitOffset>0x13</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_STXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_STXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_SSTART</name>
                            <description>Slave START Detection Interrupt</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SSTART_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SSTART_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_SSTOP</name>
                            <description>Slave STOP Detection Interrupt</description>
                            <bitOffset>0x17</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SSTOP_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SSTOP_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ICLR_SDMA_DONE1_2</name>
                            <description>DMA Done 1 on Event Channel 2</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ICLR_SDMA_DONE1_2_NO_EFFECT</name>
