fullyautomated/mspm0-svd/svd/mspm0l110x.svd
Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMEOUT_CTL_TCNTAEN</name>
                            <description>Timeout Counter A Enable</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TIMEOUT_CTL_TCNTAEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMEOUT_CTL_TCNTAEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TIMEOUT_CTL_TCNTLB</name>
                            <description>Timeout Count B Load: Counter B is used for SCL High Detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout B count. NOTE: The value of CNTLB must be greater than 1h. 

Each count is equal to 1* clock period. For example, with 10MHz functional clock one timeout period will be equal to1*100ns.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMEOUT_CTL_TCNTBEN</name>
                            <description>Timeout Counter B Enable</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TIMEOUT_CTL_TCNTBEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMEOUT_CTL_TCNTBEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMEOUT_CNT</name>
                    <description>I2C Timeout Count Register</description>
                    <addressOffset>0x1208</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00020002</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TIMEOUT_CNT_TCNTA</name>
                            <description>Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TIMEOUT_CNT_TCNTB</name>
                            <description>Timeout Count B Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter B</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSA</name>
                    <description>I2C Master Slave Address Register</description>
                    <addressOffset>0x1210</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSA_DIR</name>
                            <description>Receive/Send
The DIR bit specifies if the next master operation is a Receive (High) or Transmit (Low).
0h = Transmit
1h = Receive</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MSA_DIR_TRANSMIT</name>
                                    <description>TRANSMIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MSA_DIR_RECEIVE</name>
                                    <description>RECEIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MSA_SADDR</name>
                            <description>I2C Slave Address This field specifies bits A9 through A0 of the slave address.
In 7-bit addressing mode as selected by MSA.MODE bit, the top 3 bits are don't care</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0xA</bitWidth>
                        </field>
                        <field>
                            <name>MSA_MMODE</name>
                            <description>This bit selects the adressing mode to be used in master mode
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MSA_MMODE_MODE7</name>
                                    <description>MODE7</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MSA_MMODE_MODE10</name>
                                    <description>MODE10</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCTR</name>
                    <description>I2C Master Control Register</description>
                    <addressOffset>0x1214</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MCTR_BURSTRUN</name>
                            <description>I2C Master Enable
 
and start transaction</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MCTR_BURSTRUN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MCTR_BURSTRUN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MCTR_START</name>
                            <description>Generate START</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MCTR_START_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MCTR_START_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MCTR_STOP</name>
                            <description>Generate STOP</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MCTR_STOP_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MCTR_STOP_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MCTR_ACK</name>
                            <description>Data Acknowledge Enable.
Software needs to configure this bit to send the ACK or NACK.

