fullyautomated/mspm0-svd/svd/mspm0l110x.svd
                        </field>
                        <field>
                            <name>DIN31_0_DIO18</name>
                            <description>This bit reads the data input value of DIO18.</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO18_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO18_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO19</name>
                            <description>This bit reads the data input value of DIO19.</description>
                            <bitOffset>0x13</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO19_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO19_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO20</name>
                            <description>This bit reads the data input value of DIO20.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO20_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO20_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO21</name>
                            <description>This bit reads the data input value of DIO21.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO21_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO21_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO22</name>
                            <description>This bit reads the data input value of DIO22.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO22_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO22_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO23</name>
                            <description>This bit reads the data input value of DIO23.</description>
                            <bitOffset>0x17</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO23_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO23_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO24</name>
                            <description>This bit reads the data input value of DIO24.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO24_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO24_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO25</name>
                            <description>This bit reads the data input value of DIO25.</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO25_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO25_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO26</name>
                            <description>This bit reads the data input value of DIO26.</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO26_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO26_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO27</name>
                            <description>This bit reads the data input value of DIO27.</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO27_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO27_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO28</name>
                            <description>This bit reads the data input value of DIO28.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO28_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO28_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO29</name>
                            <description>This bit reads the data input value of DIO29.</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO29_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO29_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO30</name>
                            <description>This bit reads the data input value of DIO30.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO30_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO30_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO31</name>
                            <description>This bit reads the data input value of DIO31.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO31_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO31_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
