fullyautomated/mspm0-svd/svd/mspm0l110x.svd
                <register>
                    <name>DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DESC_MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_FEATUREVER</name>
                            <description>Feature Set for the DMA: number of DMA channel minus one  (e.g. 0-&amp;gt;1ch, 2-&amp;gt;3ch, 15-&amp;gt;16ch).</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                        </field>
                    </fields>
                </register>
            <register>
                    <name>DMAPRIO</name>
                    <description>DMA Channel Priority Control</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMAPRIO_ROUNDROBIN</name>
                            <description>Round robin. This bit enables the round-robin DMA channel priorities.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMAPRIO_ROUNDROBIN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMAPRIO_ROUNDROBIN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMAPRIO_BURSTSZ</name>
                            <description>Define the burst size of a block transfer, before the priority is re-evaluated</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMAPRIO_BURSTSZ_INFINITI</name>
                                    <description>INFINITI</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMAPRIO_BURSTSZ_BURST_8</name>
                                    <description>BURST_8</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMAPRIO_BURSTSZ_BUSRT_16</name>
                                    <description>BUSRT_16</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMAPRIO_BURSTSZ_BURST_32</name>
                                    <description>BURST_32</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMATCTL</name>
                    <description>DMA Trigger Select</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMATCTL_DMATSEL</name>
                            <description>DMA Trigger Select 

Note: Reference the datasheet of the device to see the specific trigger mapping.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMATCTL_DMATSEL_DMAREQ</name>
                                    <description>DMAREQ</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMATCTL_DMATINT</name>
                            <description>DMA Trigger by Internal Channel</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMATCTL_DMATINT_EXTERNAL</name>
                                    <description>EXTERNAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMATCTL_DMATINT_INTERNAL</name>
                                    <description>INTERNAL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACTL</name>
                    <description>DMA Channel Control</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMACTL_DMAREQ</name>
                            <description>DMA request. Software-controlled DMA start. DMAREQ is reset automatically.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMAREQ_IDLE</name>
                                    <description>IDLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAREQ_REQUEST</name>
                                    <description>REQUEST</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMAEN</name>
                            <description>DMA enable</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMAEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMASRCWDTH</name>
                            <description>DMA source width. This bit selects the source data width as a byte, half word, word or long word.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCWDTH_BYTE</name>
                                    <description>BYTE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCWDTH_HALF</name>
                                    <description>HALF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCWDTH_WORD</name>
                                    <description>WORD</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCWDTH_LONG</name>
                                    <description>LONG</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMADSTWDTH</name>
                            <description>DMA destination width. This bit selects the destination as a byte, half word, word or long word.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTWDTH_BYTE</name>
                                    <description>BYTE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTWDTH_HALF</name>
                                    <description>HALF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTWDTH_WORD</name>
                                    <description>WORD</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTWDTH_LONG</name>
                                    <description>LONG</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMASRCINCR</name>
                            <description>DMA source increment. This bit selects automatic incrementing or decrementing of the source address DMASA for each transfer. The amount of change to the DMASA is based on the definitin in the DMASRCWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMASA by 4.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_UNCHANGED</name>
                                    <description>UNCHANGED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_DECREMENT</name>
                                    <description>DECREMENT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_INCREMENT</name>
                                    <description>INCREMENT</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_2</name>
                                    <description>STRIDE_2</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_3</name>
                                    <description>STRIDE_3</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_4</name>
                                    <description>STRIDE_4</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_5</name>
                                    <description>STRIDE_5</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_6</name>
                                    <description>STRIDE_6</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_7</name>
                                    <description>STRIDE_7</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_8</name>
                                    <description>STRIDE_8</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMASRCINCR_STRIDE_9</name>
                                    <description>STRIDE_9</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMADSTINCR</name>
                            <description>DMA destination increment. This bit selects automatic incrementing or decrementing of the destination address DMADA for each transfer. The amount of change to the DMADA is based on the definitin in the DMADSTWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMADA by 4.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_UNCHANGED</name>
                                    <description>UNCHANGED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_DECREMENT</name>
                                    <description>DECREMENT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_INCREMENT</name>
                                    <description>INCREMENT</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_2</name>
                                    <description>STRIDE_2</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_3</name>
                                    <description>STRIDE_3</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_4</name>
                                    <description>STRIDE_4</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_5</name>
                                    <description>STRIDE_5</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_6</name>
                                    <description>STRIDE_6</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_7</name>
                                    <description>STRIDE_7</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_8</name>
                                    <description>STRIDE_8</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMADSTINCR_STRIDE_9</name>
                                    <description>STRIDE_9</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMATM</name>
                            <description>DMA transfer mode register

