fullyautomated/mspm0-svd/svd/mspm0l110x.svd
                <register>
                    <name>PMODECFG</name>
                    <description>Power mode configuration</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000023</resetMask>
                    <fields>
                        <field>
                            <name>PMODECFG_SYSSRAMONSTOP</name>
                            <description>SYSSRAMONSTOP selects whether the SRAM controller is enabled or disabled in STOP mode.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PMODECFG_SYSSRAMONSTOP_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_SYSSRAMONSTOP_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PMODECFG_DSLEEP</name>
                            <description>DSLEEP selects the operating mode to enter upon a DEEPSLEEP request from the CPU.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_STANDBY</name>
                                    <description>STANDBY</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_SHUTDOWN</name>
                                    <description>SHUTDOWN</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCC</name>
                    <description>Frequency clock counter (FCC) count</description>
                    <addressOffset>0x1150</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>FCC_DATA</name>
                            <description>Frequency clock counter (FCC) count value.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSOSCTRIMUSER</name>
                    <description>SYSOSC user-specified trim</description>
                    <addressOffset>0x1170</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1fff3f73</resetMask>
                    <fields>
                        <field>
                            <name>SYSOSCTRIMUSER_RESCOARSE</name>
                            <description>RESCOARSE specifies the resister coarse trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_RESFINE</name>
                            <description>RESFINE specifies the resister fine trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_RDIV</name>
                            <description>RDIV specifies the frequency correction loop (FCL) resistor trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x9</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_FREQ</name>
                            <description>FREQ specifies the target user-trimmed frequency for SYSOSC.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCTRIMUSER_FREQ_SYSOSC16M</name>
                                    <description>SYSOSC16M</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCTRIMUSER_FREQ_SYSOSC24M</name>
                                    <description>SYSOSC24M</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_CAP</name>
                            <description>CAP specifies the SYSOSC capacitor trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMBOUNDARY</name>
                    <description>SRAM Write Boundary</description>
                    <addressOffset>0x1178</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffe0</resetMask>
                    <fields>
                        <field>
                            <name>SRAMBOUNDARY_ADDR</name>
                            <description>SRAM boundary configuration. The value configured into this acts such that: SRAM accesses to addresses less than or equal value will be RW only. SRAM accesses to addresses greater than value will be RX only. Value of 0 is not valid (system will have no stack). If set to 0, the system acts as if the entire SRAM is RWX.  Any non-zero value can be configured, including a value = SRAM size.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0xF</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSTEMCFG</name>
                    <description>System configuration</description>
                    <addressOffset>0x1180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SYSTEMCFG_KEY</name>
                            <description>The key value of 1Bh (27) must be written to KEY together with contents to be updated. Reads as 0</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>27</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSTEMCFG_WWDTLP0RSTDIS</name>
                            <description>WWDTLP0RSTDIS specifies whether a WWDT Error Event will trigger a BOOTRST or an NMI.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_WWDTLP0RSTDIS_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_WWDTLP0RSTDIS_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRITELOCK</name>
                    <description>SYSCTL register write lockout</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>WRITELOCK_ACTIVE</name>
                            <description>ACTIVE controls whether critical SYSCTL registers are write protected or not.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>WRITELOCK_ACTIVE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITELOCK_ACTIVE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCAUSE</name>
                    <description>Reset cause</description>
                    <addressOffset>0x1220</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>RSTCAUSE_ID</name>
                            <description>ID is a read-to-clear field which indicates the lowest level reset cause since the last read.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_NORST</name>
                                    <description>NORST</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_PORHWFAIL</name>
                                    <description>PORHWFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_POREXNRST</name>
                                    <description>POREXNRST</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_PORSW</name>
                                    <description>PORSW</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BORSUPPLY</name>
                                    <description>BORSUPPLY</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BORWAKESHUTDN</name>
                                    <description>BORWAKESHUTDN</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTNONPMUPARITY</name>
                                    <description>BOOTNONPMUPARITY</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTCLKFAIL</name>
                                    <description>BOOTCLKFAIL</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTEXNRST</name>
                                    <description>BOOTEXNRST</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTSW</name>
                                    <description>BOOTSW</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSWWDT0</name>
                                    <description>SYSWWDT0</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSBSLEXIT</name>
                                    <description>SYSBSLEXIT</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSBSLENTRY</name>
                                    <description>SYSBSLENTRY</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSWWDT1</name>
                                    <description>SYSWWDT1</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSFLASHECC</name>
                                    <description>SYSFLASHECC</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSCPULOCK</name>
                                    <description>SYSCPULOCK</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSDBG</name>
                                    <description>SYSDBG</description>
                                    <value>26</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSSW</name>
                                    <description>SYSSW</description>
                                    <value>27</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_CPUDBG</name>
                                    <description>CPUDBG</description>
                                    <value>28</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_CPUSW</name>
                                    <description>CPUSW</description>
                                    <value>29</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESETLEVEL</name>
                    <description>Reset level for application-triggered reset command</description>
                    <addressOffset>0x1300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>RESETLEVEL_LEVEL</name>
                            <description>LEVEL is used to specify the type of reset to be issued when RESETCMD is set to generate a software triggered reset.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_CPU</name>
                                    <description>CPU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOT</name>
                                    <description>BOOT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOTLOADERENTRY</name>
                                    <description>BOOTLOADERENTRY</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_POR</name>
                                    <description>POR</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOTLOADEREXIT</name>
                                    <description>BOOTLOADEREXIT</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
