fullyautomated/mspm0-svd/svd/mspm0l110x.svd
                <register>
                    <name>CTR</name>
                    <description>Counter Register</description>
                    <addressOffset>0x1800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CTR_CCTR</name>
                            <description>Current Counter value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRCTL</name>
                    <description>Counter Control Register</description>
                    <addressOffset>0x1804</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000ff80</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CTRCTL_EN</name>
                            <description>Counter Enable.  This bit allows the timer to advance  This bit is automatically cleared if REPEAT=0 (do not automatically reload) and the counter value equals zero.  CPU Write: A register write that sets the EN bit, the counter value is set per the CVAE value. Hardware: This bit may also be set as the result of an LCOND or ZCOND condition being met and the counter value changed to the load value or zero value, respectively.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_EN_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_EN_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_REPEAT</name>
                            <description>Repeat.  The repeat bit controls whether the counter continues to advance following a zero event, or the exiting of a debug or fault condition.  If counting down, a zero event is followed by a load at the next advance condition. If counting up-down, a zero event is followed by an advance event (+1). The intent of encoding 3 is that if the debug condition is in effect, the generation of the load pulse is deferred until the debug condition is over. This allows the counter to reach zero before counting is suspended.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_REPEAT_REPEAT_0</name>
                                    <description>REPEAT_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_REPEAT_REPEAT_1</name>
                                    <description>REPEAT_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_REPEAT_REPEAT_2</name>
                                    <description>REPEAT_2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_REPEAT_REPEAT_3</name>
                                    <description>REPEAT_3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_REPEAT_REPEAT_4</name>
                                    <description>REPEAT_4</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_CM</name>
                            <description>Count Mode</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CM_DOWN</name>
                                    <description>DOWN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CM_UP_DOWN</name>
                                    <description>UP_DOWN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CM_UP</name>
                                    <description>UP</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_CVAE</name>
                            <description>Counter Value After Enable.  This field specifies the initialization condition of the counter when the EN bit is changed from 0 to 1 by a write to the CTRCTL register. Note that an external event can also cause the EN bit to go active.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CVAE_LDVAL</name>
                                    <description>LDVAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CVAE_NOCHANGE</name>
                                    <description>NOCHANGE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CVAE_ZEROVAL</name>
                                    <description>ZEROVAL</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_DRB</name>
                            <description>Debug Resume Behavior This bit specifies what the device does following the release/exit of debug mode.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_DRB_RESUME</name>
                                    <description>RESUME</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_DRB_CVAE_ACTION</name>
                                    <description>CVAE_ACTION</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_CLC</name>
                            <description>Counter Load Control.  This field specifies what controls the counter operation with respect to setting the counter to the LD register value. 

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL0_LCOND</name>
                                    <description>CCCTL0_LCOND</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL1_LCOND</name>
                                    <description>CCCTL1_LCOND</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL2_LCOND</name>
                                    <description>CCCTL2_LCOND</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL3_LCOND</name>
                                    <description>CCCTL3_LCOND</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_QEI_2INP</name>
                                    <description>QEI_2INP</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_QEI_3INP</name>
                                    <description>QEI_3INP</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_CAC</name>
                            <description>Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL0_ACOND</name>
                                    <description>CCCTL0_ACOND</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL1_ACOND</name>
                                    <description>CCCTL1_ACOND</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL2_ACOND</name>
                                    <description>CCCTL2_ACOND</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL3_ACOND</name>
                                    <description>CCCTL3_ACOND</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_QEI_2INP</name>
                                    <description>QEI_2INP</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_QEI_3INP</name>
                                    <description>QEI_3INP</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_CZC</name>
                            <description>Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL0_ZCOND</name>
                                    <description>CCCTL0_ZCOND</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL1_ZCOND</name>
                                    <description>CCCTL1_ZCOND</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL2_ZCOND</name>
                                    <description>CCCTL2_ZCOND</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL3_ZCOND</name>
                                    <description>CCCTL3_ZCOND</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_QEI_2INP</name>
                                    <description>QEI_2INP</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_QEI_3INP</name>
                                    <description>QEI_3INP</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOAD</name>
                    <description>Load Register</description>
                    <addressOffset>0x1808</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LOAD_LD</name>
                            <description>Load Value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>CC_01[%s]</name>
                    <description>Capture or Compare Register 0 to Capture or Compare Register 1</description>
                    <addressOffset>0x1810</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CC_01_CCVAL</name>
                            <description>Capture or compare value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
