fullyautomated/mspm0-svd/svd/mspm0l110x.svd
                <register>
                    <name>TSEL</name>
                    <description>Trigger Select</description>
                    <addressOffset>0x18B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TSEL_ETSEL</name>
                            <description>External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules in the same power domain. Refer to the SoC datasheet to get details.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG0</name>
                                    <description>TRIG0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG1</name>
                                    <description>TRIG1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG2</name>
                                    <description>TRIG2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG3</name>
                                    <description>TRIG3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG4</name>
                                    <description>TRIG4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG5</name>
                                    <description>TRIG5</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG6</name>
                                    <description>TRIG6</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG7</name>
                                    <description>TRIG7</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG8</name>
                                    <description>TRIG8</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG9</name>
                                    <description>TRIG9</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG10</name>
                                    <description>TRIG10</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG11</name>
                                    <description>TRIG11</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG12</name>
                                    <description>TRIG12</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG13</name>
                                    <description>TRIG13</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG14</name>
                                    <description>TRIG14</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG15</name>
                                    <description>TRIG15</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG_SUB0</name>
                                    <description>TRIG_SUB0</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG_SUB1</name>
                                    <description>TRIG_SUB1</description>
                                    <value>17</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TSEL_TE</name>
                            <description>Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TSEL_TE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_TE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers></peripheral>

   </peripherals>
</device>
